<template>
    <div style="padding: 20px">
      <h3>当前版本1.4.9</h3>
      <h3>版本说明</h3>
      <div>
        <h4>版本号1.4.9</h4>
        <div>
          <p>修复：</p>
          <p>1.素材管理-类别管理-新增/编辑类别，二级分类层级不能展开和缩回 </p>
          <p>2.识别图列表-建议识别图地址字段下显示的Q改为：V，类别字段改为：识别图上传</p>
          <p>3.识别图列表-识别方式字段传错，中台提交的是云识别，后台显示的图像本地识别</p>
          <p>4.识别图管理-识别图列表，审核不通过的识别图，不可在上传识别图</p>
          <p>5.识别图管理-识别图列表，添加识别图上传</p>
          <p>6.应用管理-删除某个素材后，页面上还显示这个素材</p>
        </div>
      </div>
      <div>
        <h4>版本号1.4.8</h4>
        <div>
          <p>更新：</p>
          <p>1.资产位置-单元级创建新增地图列表</p>
          <p>2.中台用户分配位置创建、编辑-增加地图列表</p>
          <p>3.识别图管理-增加识别方式、平台筛选</p>
        </div>
      </div>
      <div>
        <h4>版本号1.4.7</h4>
        <div>
          <p>bug、更新：</p>
          <p>1.资产位置-树状结构名称筛选回退版本，筛选全部节点</p>
          <p>2.资产位置-切换省自动清空区数据列表</p>
        </div>
      </div>
      <div>
        <h4>版本号1.4.6</h4>
        <div>
          <p>
            更新：
          </p>
          <p>1.资产位置-树状结构名称筛选修改为只针对最底层单元筛选，默认收缩状态筛选时为展开</p>
          <p>2.中台用户配置-树状结构名称筛选修改为只针对最底层单元筛选、但树结构最底层只显示到楼层，默认收缩状态筛选时为展开</p>
        </div>
      </div>
      <div>
        <h4>版本号1.4.5</h4>
        <div>
          <p>
            修复：
          </p>
          <p>1.修复后台修改导航内容引起的权限问题，导致无法查看</p>
        </div>
      </div>
      <div>
        <h4>版本号1.4.4</h4>
        <div>
          <p>
            修复：
          </p>
          <p>1.修复后台app管理页面，选择投放位置时，弹窗没有提供“关键字搜索”的功能</p>
          <p>2.中台-用户树高亮点击节点</p>
          <p>新增：</p>
          <p>1.中台-创建用户-增加重置筛选条件按钮</p>
        </div>
      </div>
      <div>
        <h4>版本号1.4.3</h4>
        <div>
          <p>
            新增：
          </p>
          <p>1.新增省市区选择</p>
        </div>
      </div>
      <div>
        <h4>版本号1.4.2</h4>
        <div>
          <p>修复：</p>
          <p>1.编辑查看应用管理，已选择素材只能显示20条</p>
        </div>
      </div>
      <h3>当前版本1.4.1</h3>
      <h3>版本说明</h3>
      <div>版本号1.4.1</div>
      <div>
        <p>修复：</p>
        <p>1. 载体模型管理、普通模型管理、动画管理：Windows资源上传时未进行格式校验</p>
      </div>
      <div>版本号1.4.0</div>
      <div>
        <p>修复：</p>
        <p>1.修复音乐格式mid上传支持</p>
      </div>
      <div>
        <h4>版本号1.3.9</h4>
        <div>
          <p>新增：</p>
          <p>1.新增音乐素材支持wav、ogg、midi格式；</p>
          <p>2.新增音乐素材格式筛选；</p>
          <p>3.新增类别管理排序；</p>
          <p>4.新增MP4视频，增加时长的排序。</p>
        </div>
      </div>
      <div>
        <h4>版本号1.3.8</h4>
        <div>
          <p>修复：</p>
          <p>1.修复玩法管理，虚拟货架包含素材不正确</p>
        </div>
      </div>
      <div>
        <h4>版本号1.3.7</h4>
        <div>
          <p>修复：</p>
          <p>1.应用管理-新增应用，玩法选择“虚拟货架”，识别图列表中的“新增时间”没有显示</p>
          <p>2.应用管理-应用管理列表，无法按玩法筛选过滤​</p>
        </div>
        <h4>版本号1.3.6</h4>
        <div>
          <p>更新：</p>
          <p>1.素材增加window素材选项，上传；</p>
          <p>2.玩法新增交互；</p>
          <p>3.新增玩法-虚拟货架BS（眼镜端)</p>
          <p>4.中台用户配置-添加中台显示《AR眼镜 App》管理菜单是否显示的选项</p>
        </div>
        <h4>版本号1.3.5</h4>
        <div>
          <p>修复：</p>
          <p>1.修复素材管理，切换模块查询未清空排序字段</p>
          <p>2.修复普通模型，不需要动画类型</p>
          <p>3.应用管理，查看素材页面排序功能不正常</p>
          <p>4.应用管理素材列表无法根据安卓资源包大小、创建时间、修改时间 排序</p >
        </div>
      </div>
      <div>
        <h4>版本号1.3.4</h4>
        <div>
          <p>修复：</p>
          <p>1.新建应用配置，选择unit版本、渲染管线，素材列表没有过滤显示对应的素材</p>
          <p>2.修复素材管理界面，排序错误</p>
          <p>3.修复素材管理界面，分页显示错误</p>
        </div>
      </div>
      <div>
        <h4>版本号1.3.3</h4>
        <div>
          <p>更新：</p>
          <p>1.应用管理-素材列表增加过滤功能</p >
          <p>2.应用管理-详情列表排序&增加过滤功能</p >
          <p>3.应用管理-新增/编辑增加过滤功能&相关素材列表排序</p >
          <p>4.中台用户配置-中台用户列表增加saasCode展示</p>
          <p>5.中台用户配置-中台用户应用列表增加unity版本和渲染管线筛选功能、列表字段展示</p>
          <p>6.中台用户配置-创建、编辑中台用户-增加中台是否显示《UtopaAR APP》管理菜单设置</p>
          <p>7.素材管理-载体模型，动画新增unity版本，渲染管道，动画类型，列表栏，筛选栏，创建选择操作</p>
          <p>8.素材管理-普通载体，动画新增unity版本，渲染管道，列表栏，筛选栏，创建选择操作</p>
          <p>9.素材管理-动画素材，增加歌词下载功能</p>
          <p>优化：</p>
          <p>1.编辑素材时，成功后不会清空筛选条件。</p>
        </div>
      </div>
      <div>
        <h4> 版本号1.3.2 && 1.3.1</h4>
        <div>
          <p>新增：</p>
          <p>1.素材新增排序，包括名称，创建时间以及修改时间排序；</p>
          <p>2.素材新增下载，在可提供下载的地方提供下载按钮提供下载。</p>
        </div>
        <div>
          <p>修复：</p>
          <p>1.修复载体模型图及预览图上传图片在提文件过大后仍能上传的bug;</p>
        </div>
      </div>
      <div>
        <h4>版本号1.3.0</h4>
        <div>
          <p>优化：</p>
          <p>1.优化接口响应时间为5分钟。</p>
        </div>
      </div>
      <div>
        <h4>版本号1.2.9</h4>
        <div>
          <p>更新：</p>
          <p>1.隐藏素材列表‘批量删除’操作。</p>
          <p>2.隐藏素材列表‘上下架’操作。</p>
        </div>
      </div>
      <div>
        <h4>版本号1.2.8</h4>
        <div>
          <p>修复：</p>
          <p>1. 应用管理编辑操作造成动画素材被清空</p>
          <p>优化：</p>
          <p>1.title图标未显示</p>
        </div>
      </div>
      <div>
        <h4>版本号1.2.7</h4>
        <div>
          <p>优化：</p>
          <p>1.优化表格样式，居中显示文字。</p>
          <p>2.优化文字‘上架’为‘上下架’。</p>
        </div>
      </div>
      <div>
        <h4>版本号1.2.6</h4>
        <div>
          <p>优化：</p>
          <p>1.优化识别图列表页面，面包屑导航栏文字。</p>
        </div>
      </div>
      <div>
        <h4>版本号1.2.5</h4>
        <div>
          <p>优化：</p>
          <p>1.优化导航栏样式。</p>
          <p>2.优化类别筛选栏交互效果。</p>
          <p>新增：</p>
          <p>1.新增-创建及修改动画素材增加lyricSize字段</p>
        </div>
      </div>
      <div>
        <h4>版本号1.2.4</h4>
        <div>
          <p>修复：</p>
          <p>1.修复 后台-识别图管理-识别图列表，上传资料包后，关闭弹出框 其他上传的包名都改变了</p>
        </div>
      </div>
      <div>
        <h4>版本号1.2.3</h4>
        <div>
          <p>修复：</p>
          <p>1.修复 后台-识别图管理-识别图列表，上传资料包后，其他上传的包名都改变了</p>
          <p>优化：</p>
          <p>1.左侧导航添加超出滚动条</p>
          <p>2.树形地址文字提示</p>
        </div>
      </div>
      <div>
        <h4>版本号1.2.2</h4>
        <div>
          <p>更新：</p>
          <p>1.更换识别图上传接口和更改文件后缀名为.zip文件</p>
          <p>优化：</p>
          <p>1.优化部分页面样式，登录页，上下架以及部分按钮</p>
        </div>
      </div>
      <div>
        <h4>版本号1.2.1</h4>
        <div>
          <p>优化：</p>
          <p>1.优化动画框输入时长字段，限制只能输入数字和英文冒号。</p>
          <p>修复：</p>
          <p>修复 后台-应用管理，点击【查看】，然后点击【返回】，点击【编辑】，里面的图片显示成空白</p >
          <p>修复 后台-应用管理，点击【编辑】，在已选动画素材列表，进行【删除】，【查询】，【批量取消】都会跳到页面最上方
          <p>更新:</p>
          <p>更新 识别图列表 上传 限制dat 资源包 并且只上传一个资源包</p >
        </div>
      </div>
      <div>版本号1.2.0</div>
      <div>
        <p>修复：</p>
        <p>修复后台-应用管理，点击【查看】，点击【类别筛选】，选择会不会自动的隐藏筛选项</p >
        <p>修复 后台-应用管理，点击【编辑】，在已选动画素材列表，查询框每次只能输入1个字符，然后重新点击，才能继续输入，键盘删除也一样</p >
      </div>
      <h4>版本号1.1.9.1</h4>
      <div>
        <p>优化：</p>
        <p>1.优化创建用户、角色、中台用户必填字段提示方式。</p>
        <h3>当前版本1.2.0</h3>
      <div>版本号1.1.9</div>
      <div>
        <p>优化：</p>
        <p>1.优化动画时长输入框，输入中文冒号后将会自动替换成英文冒号。</p>
        <p>2.优化类别管理页面，在未选分类时，新增一级分类按钮隐藏。</p>
      </div>
      <div>版本号1.1.8</div>
      <div>
        <p>修复：</p>
        <p>后台-识别图管理-识别图列表，上传资料包后，点击删除，资料包的信息没有清空</p >
        <p>后台-识别图管理-识别图列表，点击【所属渠道】，格式跟类别那个地方不一样，建议把全部放回最上面</p >
        <p>后台 -识别图上传限制45M以内</p >
      </div>
      <div>版本号1.1.7</div>
      <div>
        <p>修复：</p>
        <p>1.修复预览音乐点击多个预览后，图标显示问题。</p>
        <p>2.修复创建应用图片访问路径报错。</p>
        <p>3.位置列表placeholder文字修改。</p>
      </div>
      <div>版本号1.1.6</div>
      <div>
        <p>修复：</p>
        <p>1.修复识别图列表未勾选  给出提示。</p>
        <p>2.修复应用管理  切换模型，音乐停止。</p>
        <p>3.修复中台用户配置-新建用户，选择地址时，无法正常显示第二页数据。</p>
      </div>
      <div>版本号1.1.5</div>
      <div>
        <p>更新：</p>
        <p>1.更新前端上传接口，返回字节，前端转换为兆</p>
        <p>2.音乐预览播放一次后无法恢复图标，无法再次播放</p >
      </div>
      <div>版本号1.1.4</div>
      <div>
        <p>修复：</p>
        <p>1.地址启用禁用纳入编辑权限</p>
        <p>2.地址管理查询初始化列表</p>
        <p>3.更新素材筛选时间，改为创建时间段</p>
        <p>4.更新类别管路筛选时间，改为创建时间段</p>
        <p>5.【查看】和【删除】状态下应该禁用【上传】按钮</p >
        <p>6.识别图“未通过”建议改为“不通过”，保持统一</p >
        <p>7.未勾选记录进行批量删除时应给出提示，而不是进行“确认删除”操作</p >
        <p>8.上下架功能应纳入编辑权限中</p >
        <p>更新：</p>
        <p>1.素材上传接口</p>
        <p>2.屏幕自适应</p>
        <p></p>
      </div>
      <div>版本号1.1.3</div>
      <div>
        <p>新增：</p>
        <p>1.新增登录用户识别字段。</p>
        <p>修复：</p>
        <p>1.修复素材上架功能。</p>
        <p>2.修复音乐播放功能。</p>
        <p>3.修复退出后页面样式问题。</p>
        <p></p>
      </div>
      <div>版本号1.1.2</div>
      <div>
        <p>修复：</p>
        <p>1.中台用户配置：应用数和地址数弹出框无数据、因地址树节点点击失效，无法分配地址.</p>
      </div>
      <h4>版本号1.1.1</h4>
      <div>
        <p>修复：</p>
        <p>1.修复退出账户后页面导航栏显示错误。</p>
        <p>2.修复中台用户已选地址无法取消问题。</p>
        <p>3.去除批量选择和批量删除操作。</p>
        <p>4.去掉状态筛选。</p>
        <p>5.修复审批权限无法进行权限控制问题。</p>
        <p>新增：</p>
        <p>1.中台创建用户新增切换页码高亮已选择的行。</p>
      </div>
      <h4>版本号1.1.0</h4>
      <div>
        <p>优化:</p>
        <p>1.优化素材管理页面，增加必填标志，以及必填未填提交时的错误提示（音乐，模型，视频，mp4等页面）。</p>
        <p>2.优化上传提示，优化上传格式限制，限制相关页面gif图和jpg,png图片的上传限制。</p>
        <p>3.优化输入框的长度限制，增加最大长度50的输入限制。</p>
        <p>4.优化输入框限制，在数字输入框限制只能输入数字。</p>
        <p>5.位置搜索的重置按钮优化</p >
        <p>修复：</p>
        <p>1.修复音乐文件无法试听的问题。</p>
        <p>2.修复类别管理页面展示模块id,改为模块名称。</p>
        <p>3.修复类别管理页面，删除编辑权限未控制的情况。</p>
        <p>4.修复类别管理页面，类别名过长会覆盖下一行的问题。</p>
        <p>5.修复在线视频页面，前端拼凑视频地址问题。</p>
        <p>6.修复玩法页面，玩法说明未显示问题。</p>
        <p>7.修复动画管理页面，增加总时长列。</p>
        <p>8.修复素材管理页面，增加类别筛选条件。</p>
        <p>9.修复识别图管理-识别图列表页面，在识别图列表的第二页页面，直接点击左边菜单的“未审核”模块，页数显示也是第二页，但是页面却是第一页的内容问题。</p>
        <p>10.修复审批权限无法进行权限控制。</p>
        <p>11.修复查看页面和编辑页面已选素材数对不上问题。</p>
        <p>12.修复在线视频取消资源包大小字段。 </p>
        <p>13.修复后台-应用管理，将列名“类别”改成“状态” 。</p>
        <p>14.修复上传报错。</p>
        <p>15.修复批量删除列表刷新显示空。</p >
        <p>16.修复中台用户查看位置项目名称级别显示问题。</p >
        <p>17.删除创建中台用户的批量选择和批量删除按钮</p >
        <p>更新：</p>
        <p>1.新增，素材管理页面新增上下架操作，以及操作管理权限。</p>
        <p>2.新增，素材管理搜索时间选择改为创建时间段时间。</p>
        <p>3.新增后再次新增时，新增界面应保持与前一次一致</p >
        <p>4.新增编辑后，地址树刷新保持展开上次的层级</p >
        <p>6.增加位置树形超出滑动条</p >
      </div>
      <h4>版本号1.0.5</h4>
      <div>
        <p>bug修复</p>
        <p>1.中台用户列表搜索优化</p>
        <p>2.资产创建弹框原型修改，去掉种类下拉框，数据从树形结构获取,修复创建编辑相关bug</p>
        <p>3.新增项目保存成功后，左侧地址树未刷新显示</p>
        <p>4.无法批量删除中台用户</p>
        <p>新增:</p>
        <p>1.创建中台用户中的应用列表添加上下架状态</p>
      </div>
      <h4>版本号1.0.4</h4>
      <div>
        <p>版本号1.0.4</p>
        <p>更新</p>
        <p>1.更新应用上传字段。</p>
      </div>
      <div>
        <p>版本号1.0.3</p>
        <p>bug修复</p>
        <p>1.用户列表“职位”字段建议取消</p>
        <p>2.资产添加报空指针异常</p>
        <p>3.批量删除后列表内容刷新显示错误</p>
        <p>4.音乐素材内容显示错误</p>
        <p>5.编辑动画显示不正确</p>
      </div>
      <h4>版本号1.0.2</h4>
      <div>
        <p>新增：</p>
        <p>1.新增音乐mp4视频模块增加ios字段。</p>
      </div>
      <h4>版本号1.0.1</h4>
      <div>
        <p>修复：</p>
        <p>1.修复用户权限管理前端传入字段。</p>
      </div>
      <h4>版本号1.0.0</h4>
      <div>
        <p>完成</p>
        <p>1.完成utopaAR后台管理页面功能。</p>
        <p>优化</p>
        <p>1.优化前端框架写法，更好的记录页面信息和用户信息。</p>
        <p>感谢</p>
        <p>1.感谢前后端小伙伴一起努力，感谢练习时长两年半的前端练习生徐，和前端仙女吴。</p>
        <h1 style="color: red">
          let's enjoy it;
        </h1>
      </div>
    </div>
    </div>
</template>

<script>
    export default {
        name: "version"
    }
</script>

<style scoped>

</style>
