<template>
<div style="padding: 20px">
    <div>
      当前版本：1.5.6
    </div>
    <h3>版本说明</h3>
    <div>
      <h4>版本号1.5.6</h4>
      <p>修复：</p>
      <p>1.中台-UtopaAR App-app应用管理，建议所属地区分行显示；</p>
      <p>2.中台-UtopaAR App-app应用管理，“位置”一列的文字改成“地理位置”</p>
      <p>3.投放管理将取消分配的位置置灰，并且不允许操作投放和空间识别图</p>
    </div>
    <div>
      <h4>版本号1.5.5</h4>
      <p>修复：</p>
      <p>1.投放列表：查询条件中的投放状态选择“投放中”，实际显示为“结束”</p>
      <p>2.修复页面配置投放状态过滤条件失效</p>
    </div>
    <div>
      <h4>版本号1.5.4</h4>
      <p>新增;</p>
      <p>1.app应用管理--新增分享信息页面</p>
    </div>
    <div>
      <h4>版本号1.5.3</h4>
      <div>
        <p>修复：</p>
        <p>1.空间识别图：【编辑】时方向变为0</p>
        <p>2.中台-UtopaAR APP-app应用管理-应用名称，最新保存时间排序</p>
      </div>
    </div>
    <div>
    <h4>版本号1.5.2</h4>
    <div>
      <p>更新：</p>
      <p>1.应用管理>左上角的名称跟左侧栏的顶级名称保持一致</p>
      <p>2.应用管理>内容管理>编辑>编辑>添加背景音乐，增加格式菜单栏、格式筛选框、时长的排序</p>
      <p>3.应用管理>素材管理>音乐素材，增加格式菜单栏、格式筛选框、时长的排序</p>
      <p>4.应用管理>内容管理>编辑/新增>mp4, 新增时长排序</p>
      <p>5.应用管理>素材管理>MP4视频，增加时长的排序</p>
    </div>
  </div>
    <div>
      <h4>版本号1.5.1</h4>
      <div>
        <p>新增：</p>
        <p>1.新增APP应用管理页面，分享内容必填判断</p>
      </div>
    </div>
    <div>
      <h4>版本号1.5.0</h4>
      <div>
        <p>修复：</p>
        <p>1.创建投放-投放列表时间设置重叠，可以保存成功</p>
      </div>
    </div>
    <div>
      <h4>版本号1.4.9</h4>
      <div>
        <p>修复：</p>
        <p>1.应用管理-ar拍照应用，编辑内容页面，mp4视频的列表只显示“资源包大小”</p>
        <p>2.AR眼镜App-对非第一页内容进行全选批量删除后，列表数据显示有误</p>
        <p>3.AR眼镜App-应用数量详情，建议调整“投放ID”和“投放时间”列表的宽度，使投放时间可以在一行显示</p>
      </div>
    </div>
    <div>
      <h4>版本号1.4.8</h4>
      <div>
        <p>修复：</p>
        <p>1.AR眼镜App，识别图数量和应用数量无法点击查看详细信息</p>
        <p>2.投放管理-空间识别图，投放方向加上角度“ ° ”</p>
        <p>3.投放管理-编辑虚拟货架投放，添加内容计划，没有出现识别图列表</p>
        <p>4.AR眼镜App-新增位置投放，识别图和应用列表的“投放方向”的“x，y，z”改成“α、β、γ”，并加上角度“ ° ”</p>
      </div>
    </div>
    <div>
      <h4>版本号1.4.7</h4>
      <div>
        <p>修复：</p>
        <p>1.NovaStage列表“场景名称”改为“场次名称”</p>
        <p>2.增加识别图输入框宽度</p>
        <p>3.应用管理-虚拟货架，建议搜索输入框中的提示改成“输入识别图关键字”</p>
         <p>4.应用管理，眼镜端应用的素材管理没有显示windows 资源包大小</p>
      </div>
    </div>
    <h4>版本号1.4.6</h4>
    <div>
      <P>更新:</P>
      <p>1.同一个地点支持多个应用投放</p>
      <p>2.新增投发管理-选择应用虚拟货架BS素材更改  素材</p>
      <p>3.增加应用管理-BS虚拟货架 </p>
      <p>4.增加AR眼镜App的位置投放页面</p>
      <p>5.增加新玩法路由配置</p>
      <p>6.NovaStage\AR拍照应用中素材列表增加windows字段显示与排序功能</p>
      <p>7.识别图增加方向定位和位置定位</p>
    </div>
    <div>
      <p>修复：</p>
      <p>1.修复新建场景，选择场景模型名称显示重叠</p>
      <p>2.反馈问题，根据反馈实际搜索，建议结束区间的时间默认在23：59：59</p>
    </div>
    <div>
      <p>新增：</p>
      <p>1.问题反馈 反馈时间排序 和 修改时间排序 </p >
    </div>
    <div>
      <h4>版本号1.4.3</h4>
      <div>
        <p>修复：</p>
        <p>1.问题反馈，时间筛选加了一个结束时间</p>
        <p>2.问题反馈列表，进度显示不一致</p>
        <p>3.应用列表增加渲染管道字段和筛选条件</p>
        <p>4.问题反馈，查看图片显示太小，显示不清晰</p>
      </div>
    </div>
    <div>
      <h4>版本号1.4.2</h4>
      <div>
        <p>修复：</p>
        <p>1.修复编辑app应用管理页面，应用类型不显示的bug</p>
      </div>
    </div>
    <div>
      <h4>版本号1.4.1</h4>
      <div>
        <p>更新：</p>
        <p>1.app应用管理-应用类型下拉框改为弹窗，并增加筛选操作</p>
        <p>2.应用管理-所有素材列表新增排序功能</p>
        <p>修复：</p>
        <p>1.修复识别图页面，在点击添加位置后返回上级仍能继续添加识别图的bug</p>
      </div>
    </div>
    <div>
      <h4>版本号1.4.0</h4>
      <div>
        <p>修改：</p>
        <p>1.修改识别图标题为识别图名称；</p>
        <p>2.修改识别图宽度，在未审核状态下可以修改识别图宽度；</p>
        <p>3.修改识别图页面，增加宽度显示。</p>
        <p>4.中台投放的调整位置界面，要显示当前调整物体的名称</p >
        <p>5.投放列表里的内容计划，把计划展示时间改成展示时间</p >
        <p>6.投放列表里的内容计划，展示时间的格式跟基础信息里的投放时间，格式保持一致</p >
        <p>7.投放列表里的内容计划，把清空列表的按钮加上蓝色背景色，字体白色</p >
        <p>8.投放列表里底部的确定和取消按钮挪到底部中间位置</p >
        <p>9.场次播放时间改为场次时间</p>
        <p>10.场景播放时间改为场景时间</p>
        <p>11.歌剧院玩法，在投放时，新建和编辑时都能能显示上一级时间供参考</p>
        <p>新增：中台的app问题反馈列表</p >
        <p>优化：</p>
        <p>1.优化宽度输入提示，为‘m’；</p>
        <p>新增</p>
        <p>1.app投放页面分享新增链接，图片，网址类型，并新增相关输入。</p>
      </div>
    </div>
    <div>
      <h4>版本号1.3.5</h4>
      <div>
        <p>优化：</p>
        <p>1.优化接口响应时间为5分钟。</p>
      </div>
    </div>
    <div>
      <div>版本号1.3.4</div>
      <div>
        <p>优化：</p>
        <p>1.优化场景节目手动输入时间提示跨天。</p >
      </div>
    </div>
  <div>
    <div>本版号1.3.3</div>
    <div>
      <p>优化：</p>
      <p>1.优化 识别图管理页面，在切换导航栏状态后（如 全部->待审核），隐藏上传标志和操作，改为禁止操作。</p >
    </div>
  </div>
    <div>
      <div>本版号1.3.2</div>
    <div>
      <p>修复：</p>
      <p>1.修复投放列表：内容计划时间（禁用、启用）  状态 重复时间问题。</p >
    </div>
    </div>
    <div>本版号1.3.1</div>
    <div>
      <p>优化：</p>
      <p>1.投放列表：内容计划时间（禁用、启用）  状态 重复时间重新优化。</p >
    </div>
    <div>
      <h4>版本号1.3.0</h4>
      <div>
        <p>投放列表：修复 切换内容计划 时间重叠提示错误，无法进行时间选择</p >
      </div>
    </div>
    <div>
      <h4>版本号1.2.9</h4>
      <div>
        <p>更新：</p>
        <p>1.添加noverstage场景的背景音乐播放顺序不能重复。</p>
      </div>
    </div>
    <div>
      <h4>版本号1.2.8</h4>
      <div>
        <p>优化：</p>
        <p>1.优化app应用管理创建及修改页面，输入框长度限制，标题类长度限制为50，网站长度为200，地址限制为100。</p>
      </div>
    </div>
    <div>
      <h4>版本号1.2.7</h4>
      <div>
        <p>修改：</p>
        <p>1.修改识别图输入框限制，改为可输入小数，并且最多为两位小数。</p>
      </div>
    </div>
    <div>
      <h4>版本号1.2.6</h4>
      <div>
        <p>优化：</p>
        <p>1.优化表格样式，居中显示文字。</p>
        <p>2.优化文字‘上架’为‘上下架’。</p>
        <p>修复：</p>
        <p>1.修复新增节目页面，时间计算。</p>
      </div>
    </div>
    <div>
      <h4>版本号1.2.5</h4>
      <div>
        <p>优化：</p>
        <p>1.优化投放管理页面导航栏样式。</p>
      </div>
    </div>

    <div>
      <h4>版本号1.2.4</h4>
      <div>
        <p>优化：</p>
        <p>1.优化导航栏样式。</p>
        <p>2.优化类别筛选交互效果。</p>
      </div>
    </div>
    <h4>版本号1.2.3</h4>
    <div>
      <p>修复：</p>
      <p>1.AR拍照内容管理MP4视频预览内容未显示</p>
    </div>
    <h4>版本号1.2.2</h4>
    <div>
      <p>修复：</p>
      <p>1.场景上下架失败状态恢复</p>
    </div>
    <h4>版本号1.2.1</h4>
    <div>
      <p>修复：</p>
      <p>1.修复识别图管理页面，切换标签栏分页显示错误问题。</p>
      <p>优化：</p>
      <p>1.优化部分样式。</p>
    </div>
    <h4>版本号1.2.0</h4>
    <div>
      <p>修复：</p>
      <p>1.修复 中台-noverstage-素材管理，资源包的文件大小有误</p>
      <p>2.修复 中台-投放列表 展示规则选择“按天”时，无法输入时间</p>
      <p>更新：</p>
      <p>更改 中台-投放列表 内容计划 展示规则 日期为1 时间段为2 </p>
      <p>优化：</p>
      <p>1.左侧导航添加超出滑动条</p>
      <p>2.创建模块样式优化，缩略图添加点击查看大图功能</p>
      <p>3.优化 中台-投放列表 切换应用时，建议清空数据，避免内容计划与实际所选应用不一致</p>
    </div>
    <h4>版本号1.1.9</h4>
    <div>
      <p>更新：</p>
      <p>1.新增场景增加场景上架状态字段</p>
      <p>优化：</p>
      <p>1.树形地址文字提示</p>
    </div>
    <h4>版本号1.1.8</h4>
    <div>
      <p>修复：</p>
      <p>1.修复 场景时间冲突提示。</p>
      <p>优化：</p>
      <p>1.优化部分页面样式</p>
    </div>
    <h4>版本号1.1.7</h4>
    <div>
      <p>修复：</p>
      <p>1.修复 中台-noverstage素材管理，搜索框输入单个失焦。</p>
      <p>优化：</p>
      <p>1.优化部分页面样式</p>
    </div>
    <h4>版本号1.1.6</h4>
    <div>
      <p>更新：</p>
      <p>1.更新APP应用管理和页面配置页面，启用禁用字段参数。</p>
      <p>修复：</p>
      <p>1.修复APP应用管理页面搜索框强制刷新后，应用类型变为编号问题。</p>
      <p>优化：</p>
      <p>1.优化部分页面样式，登录页，上下架以及部分按钮。</p>
      <p>2.优化创建模块时，点击“X”号取消时间后，保留勾选、保留时间框可用。</p>
    </div>
    <h4>版本号1.1.5</h4>
    <div>
      <p>修复：</p>
      <p>1.修复   投放列表- 查看详情投放时，左侧菜单显示有误</p>
      <p>2.修复   投放列表- 关键字过滤后，进行【编辑】或者【删除】或者【查看】操作，左侧树保持与操作前一致和新增投放按钮显示问题</p>
      <p>样式：</p>
      <p>1.创建编辑位置、场次去掉确认框</p>
    </div>
    <h4>版本号1.1.4</h4>
    <div>
      <p>修复：</p>
      <p>1.ar拍照内容列表强制刷新页面后，类别筛选显示为编号</p>
      <p>2.修复 投放列表-关键字过滤后，进行【编辑】或者【删除】操作，左侧树保持与操作前一致</p>
      <p>3.修复App管理页面，所有用户和注册用户字段获取问题</p>
      <p>优化：</p>
      <p>1.应用模块1中关联应用展示应用名称</p>
    </div>
    <h4>版本号1.1.3</h4>
    <div>
      <p>修复：</p>
      <p>1.切换“模块选择”后，提示框不显示</p>
      <p>2.编辑状态时，已上传的图片缩略图未显示</p>
      <p>更新：</p>
      <p>1.添加应用名称字段编辑时展示</p>
      <p>优化：</p>
      <p>1.模块列表优化排序方式</p>
      <p>2.创建模块选择应用详情页界面布局应调整</p>
    </div>
    <h4>版本号1.1.2</h4>
    <div>
      <p>修复：</p>
      <p>1.模块关联应用详情应用类型下拉框取值更换接口</p>
      <p>2.模块关联应用详情应用类型、创建时间字段显示</p>
      <p>3.创建模块标题字段未保存</p>
      <p>4.模块列表数据过滤后进行新增操作，新增成功后查询条件与列表数据不匹配</p>
      <p>5.修复投放列表-查询条件投放ID应限制仅能输入数字，避免接口抛异常</p>
      <p>6.修复投放列表-查询区域字体大小应一致，并且与其它功能页面保持统一</p>
      <p>更新：</p>
      <p>1.删除关联应用详情里的玩法下拉框</p>
    </div>
    <h4>版本号1.1.1</h4>
    <div>
      <p>修复：</p>
      <p>1.投放记录【编辑】页面缺少【清空列表】功能</p>
      <p>2.投放列表【重置】功能失效</p>
      <p>3.页面配置中的“播放时段”应改为“投放时段”</p>
      <p>4.创建模块选择应用详情【重置】功能失效</p>
      <p>优化：</p>
      <p>1.创建模块应用选择后应该显示应用名称</p>
      <p>2.创建模块切换“模块选择”后页面数据清空</p>
      <p>3.优化创建模块、角色、用户的必填提示方式</p>
      <p>更新：</p>
      <p>1.查询条件的时间段区间建议改为单值查询</p>
      <p>2.添加投放时间判断</p>
      <p>3.创建模块上传图片后应显示缩略图</p>
      <p>4.增加500报错</p>
      <p>5.增加应用管理页面relatetypeid字段</p>
    </div>
    <h4>版本号1.1.0</h4>
    <div>
      <p>修复：</p>
      <p>1.修复app应用管理页面，前端控制权限取错字段问题。</p>
    </div>
    <h4>版本号1.0.9</h4>
    <div>
      <p>修复：</p>
      <p>1.创建投放规则为“按天”时，无法选择时间</p>
      <p>2.创建投放一次选超过3条记录，无法选择时间</p>
    </div>
    <h4>版本号1.0.8</h4>
    <div>
      <p>修复：</p>
      <p>1.NoverStage音乐播放多个点击播放图标显示问题</p>
      <p>2.创建投放时的提示信息应该改为中文提示 </p>
      <p>3.编辑投放记录时，内容计划展示时间重复校验不严谨</p>
      <p>4.投放记录存在一条状态为启用时，通过列表数据过滤后进行添加新的投放记录时，前端应该抛出接口所返回的错误提示信息</p>
      <p>5.计划展示时间未填写时进行展示规则切换不应给出提示</p>
      <p>6.投放位置和投放方向应限制仅能输入数字</p>
      <p>7.切换位置后，投放信息前端显示有误</p>
    </div>
    <h4>版本号1.0.7</h4>
    <div>
      <p>修复：</p>
      <p>1.地址启用禁用纳入编辑权限</p>
      <p>2.位置管理点击查询清空列表</p>
      <p>3.重置后页面初始化进入状态</p>
      <p>4.AR拍照图片路径报错404</p>
      <p>5.点击页面配置时左侧导航对应不上</p>
      <p>6.应用管理-Nover Stage素材管理，音乐预览后无法停止</p>
      <p>7.修复识别图分页错误问题</p>
      <p>8.修复识别图位置跳转搜索框不清空问题</p>
      <p>9.修复应用管理图片不显示问题</p>
      <p>10.修复应用管理状态搜索字段错误问题</p>
      <p>11.创建投放时的提示信息应该改为中文提示</p >
      <p>12.音乐预览播放一次后无法恢复图标，无法再次播放</p>
      <p>更新：</p>
      <p>1.stage、AR拍照内容列表批量删除后重置回第一页</p>
      <p>2.更新页面显示时间问题</p>
      <p>3.资源包大小转换成单位M</p>
      <p>4.屏幕自适应</p>
    </div>
    <h4>版本号1.0.6</h4>
    <div>
      <p>修复：</p>
      <p>1.ar内容列表增加创建人显示</p>
      <p>2.ar内容列表关键字不起作用</p>
      <p>3.新建场次的时间样式</p>
      <p>4.新增场景，场景模型关联样式</p>
      <p>5.stage场景列表无法分页</p>
      <p>6.音乐排序第一次只能填一个数字</p>
      <p>7.编辑场景-背景音乐无法试听</p>
      <p>8.ar创建内容素材列表去掉歌词、时长字段</p>
      <p>9.地址树节点点击失效，无法新增位置信息</p>
      <p>10.添加投放时，左侧菜单显示错误</p>
      <p>11.AR内容列表下架同一红色</p>
      <p>12.首页“后台"字眼应该改为"中台" </p>  
      <p>13.MP4预览内容未显示 激活</p> 
      <p>14.创建新内容页面有误 激活  添加投放后左侧地址树被收起，建议保持与添加前一致</p>
      <p>15.投放信息无法根据创建时间进行筛查，查询结束数据有误</p>  
      <p>16.动画总时长字段内容未显示</p>
      <p>17.中台应用管理中的动画、场景模型菜单点击时报404</p>
      <p>18.中台-应用管理-Nover Stage素材管理，音乐预览后无法停止</p>
      <p>19.内容计划时分秒控件无法进行滚动选择</p>
      <p>20.修复识别提页面分页点击无反应问题；</p>
      <p>21.修复识别图页面必填字段校验；</p>
      <p>22.修复识别图页面，首次进入时，默认展开所有识别图；</p>
      <p>23.修复应用页面必填字段；</p>
      <p>24.修复应用页面弹窗样式问题。</p>

      <p>更新：</p>
      <p>1.中台创建内容，删除了有效时间</p>
      <p>2.新增、编辑节目增加节目时间判断：判断是否超出场景时间、与其他时间重叠</p>
      <p>3.新增、编辑场景增加场景时间判断：判断是否有节目超出场景时间</p>
      <p>4.新增中台创建内容关联素材列表上下架字段显示，并且下架素材无法选择</p>
      <p>5.音乐播放完自动暂停</p>
      <p>6.投放增加了时间重叠判断，重启和停用判断</p>
    </div>
    <h4>版本号1.0.5</h4>
    <div>
      <p>修复：</p>
      <p>1.修复app管理页面，保存报错bug。</p>
    </div>
    <h4>版本号1.0.4</h4>
    <div>
      <p>修复：</p>
      <p>1.修复强制刷新后页面不显示问题。</p>
    </div>
    <h4>版本号1.0.3</h4>
    <div>
      <p>bug修复</p>
      <p>1.投放管理-》投放列表 初始化进入投放列表的提示信息建议取消</p>
      <p>2.投放管理-》投放列表 投放列表点击位置时前端报错</p>
    </div>
    <h4>版本号1.0.2</h4>
    <div>
      <p>bug修复</p>
      <p>1.部分appId固定未从后端获取</p>
    </div>
    <h4>版本号1.0.1</h4>
    <div>
      <p>bug修复</p>
      <p>1.内容管理所有列表请求方式post</p>
      <p>2.ar内容的素材以及下拉框接口更换</p>
      <p>新增:</p>
      <p>1.app管理权限</p>
    </div>
    <div>
      <p>
        版本号1.0.0
      </p>
      <p>
        完成：完成utopa AR中台相关功能。
      </p>
    </div>
  </div>
</template>

<script>
    export default {
        name: "version"
    }
</script>

<style scoped>

</style>
